## Data Analysis Project

In [1]:
#Imports
import numpy as np
import pandas as pd
import pandas_profiling

In [2]:
#!pip install mysql-connector-python

import mysql.connector
from mysql.connector import Error

def getrecords_from_db_to_df(query):
    try:
        connection = mysql.connector.connect(host='cpanel.insaid.co',
                                             database='Capstone1',
                                             user='student',
                                             password='student')
        if connection.is_connected():
            db_Info = connection.get_server_info()
            print("Connected to MySQL Server version ", db_Info)
            df =  pd.read_sql_query(query, connection)
            #record = cursor.fetchone()
            print("output is done")
            return  df
    except Error as e:
        print("Error while connecting to MySQL", e)
    finally:
        if (connection.is_connected()):
            connection.close()
            print("MySQL connection is closed")

In [3]:
query = "select * from gender_age_train"
df_gender_age = getrecords_from_db_to_df(query)

Connected to MySQL Server version  5.6.47-cll-lve
output is done
MySQL connection is closed

In [4]:
query = "select * from phone_brand_device_model"
df_phone_brand_device_model = getrecords_from_db_to_df(query)

Connected to MySQL Server version  5.6.47-cll-lve
output is done
MySQL connection is closed

## Data Analysis

In [5]:
df_events = pd.read_csv('.\events_data.csv')
df_events.head(10)

,event_id,device_id,timestamp,longitude,latitude,city,state
0,2765368,2.973348e+18,2016-05-07 22:52:05,77.225676,28.730140,Delhi,Delhi
1,2955066,4.734221e+18,2016-05-01 20:44:16,88.388361,22.660325,Calcutta,WestBengal
2,605968,-3.264500e+18,2016-05-02 14:23:04,77.256809,28.757906,Delhi,Delhi
3,448114,5.731369e+18,2016-05-03 13:21:16,80.343613,13.153332,Chennai,TamilNadu
4,665740,3.388880e+17,2016-05-06 03:51:05,85.997745,23.842609,Bokaro,Jharkhand
5,1078723,-5.124242e+17,2016-05-02 02:21:20,83.398244,17.768149,Visakhapatnam,AndhraPradesh
6,2948755,5.536513e+18,2016-05-03 16:20:14,80.359796,13.128174,Chennai,TamilNadu
7,280014,-8.879644e+18,2016-05-05 13:06:01,78.155397,16.390327,Wanparti,AndhraPradesh
8,2309828,3.020769e+18,2016-05-04 09:24:50,77.263922,28.757914,Delhi,Delhi
9,720049,4.928556e+18,2016-05-06 19:00:52,72.844795,18.974929,Mumbai,Maharashtra

In [6]:
df_events.shape

(3252950, 7)

In [7]:
#Find the Missing Values
df_events.isnull().sum()

event_id       0
device_id    453
timestamp      0
longitude    423
latitude     423
city           0
state        377
dtype: int64

In [8]:
#pre profiling to get insights
#profile_events = pandas_profiling.ProfileReport(df_events, minimal = True)
#profile_events.to_file("events_pre_profiling.html")

HBox(children=(FloatProgress(value=0.0, description='variables', max=7.0, style=ProgressStyle(description_widt…

HBox(children=(FloatProgress(value=0.0, description='table', max=1.0, style=ProgressStyle(description_width='i…

HBox(children=(FloatProgress(value=0.0, description='warnings', max=3.0, style=ProgressStyle(description_width…

HBox(children=(FloatProgress(value=0.0, description='package', max=1.0, style=ProgressStyle(description_width=…

HBox(children=(FloatProgress(value=0.0, description='build report structure', max=1.0, style=ProgressStyle(des…

In [8]:
df_gender_age.head(10)

             device_id gender  age   group
0 -8076087639492063270      M   35  M32-38
1 -2897161552818060146      M   35  M32-38
2 -8260683887967679142      M   35  M32-38
3 -4938849341048082022      M   30  M29-31
4   245133531816851882      M   30  M29-31
5 -1297074871525174196      F   24  F24-26
6   236877999787307864      M   36  M32-38
7 -8098239495777311881      M   38  M32-38
8   176515041953473526      M   33  M32-38
9  1596610250680140042      F   36  F33-42

In [9]:
df_gender_age.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 74645 entries, 0 to 74644
Data columns (total 4 columns):
device_id    74645 non-null int64
gender       74645 non-null object
age          74645 non-null int64
group        74645 non-null object
dtypes: int64(2), object(2)
memory usage: 2.3+ MB

In [11]:
#profile_gender_age = pandas_profiling.ProfileReport(df_gender_age)
#profile_gender_age.to_file("Gender_Age_pre_profiling.html")

HBox(children=(FloatProgress(value=0.0, description='variables', max=4.0, style=ProgressStyle(description_widt…

c:\users\oye\appdata\local\programs\python\python37\lib\site-packages\pandas_profiling\model\describe.py:79: RuntimeWarning: overflow encountered in longlong_scalars
  stats["range"] = stats["max"] - stats["min"]

HBox(children=(FloatProgress(value=0.0, description='table', max=1.0, style=ProgressStyle(description_width='i…

HBox(children=(FloatProgress(value=0.0, description='warnings', max=3.0, style=ProgressStyle(description_width…

HBox(children=(FloatProgress(value=0.0, description='package', max=1.0, style=ProgressStyle(description_width=…

HBox(children=(FloatProgress(value=0.0, description='build report structure', max=1.0, style=ProgressStyle(des…

In [10]:
df_gender_age.shape

(74645, 4)

In [11]:
df_gender_age.isnull().sum()

device_id    0
gender       0
age          0
group        0
dtype: int64

In [12]:
df_gender_age.head(10)

             device_id gender  age   group
0 -8076087639492063270      M   35  M32-38
1 -2897161552818060146      M   35  M32-38
2 -8260683887967679142      M   35  M32-38
3 -4938849341048082022      M   30  M29-31
4   245133531816851882      M   30  M29-31
5 -1297074871525174196      F   24  F24-26
6   236877999787307864      M   36  M32-38
7 -8098239495777311881      M   38  M32-38
8   176515041953473526      M   33  M32-38
9  1596610250680140042      F   36  F33-42

In [13]:
df_phone_brand_device_model.head(10)

             device_id phone_brand        device_model
0  1877775838486905855        vivo                 Y13
1 -3766087376657242966          小米                V183
2 -6238937574958215831        OPPO                 R7s
3  8973197758510677470          三星               A368t
4 -2015528097870762664          小米             红米Note2
5 -8896952452425303597          小米             红米Note3
6 -2634171391322875113          小米                S5.1
7 -2526386806972133373          三星  Galaxy Grand Prime
8  1427934937997164515          小米               MI 2S
9  2866484947180243791          三星       Galaxy Note 2

In [14]:
df_phone_brand_device_model.shape

(87726, 3)

In [15]:
df_phone_brand_device_model.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 87726 entries, 0 to 87725
Data columns (total 3 columns):
device_id       87726 non-null int64
phone_brand     87726 non-null object
device_model    87726 non-null object
dtypes: int64(1), object(2)
memory usage: 2.0+ MB

In [16]:
df_phone_brand_device_model.describe()

          device_id
count  8.772600e+04
mean  -5.212557e+15
std    5.330157e+18
min   -9.223322e+18
25%   -4.623331e+18
50%   -3.109802e+16
75%    4.635194e+18
max    9.222849e+18

In [17]:
df_phone_brand_device_model.isnull().sum()

device_id       0
phone_brand     0
device_model    0
dtype: int64

In [18]:
profile_phbd = pandas_profiling.ProfileReport(df_phone_brand_device_model)
profile_phbd.to_file("phone_brand_device_model_pre_profiling.html")

HBox(children=(FloatProgress(value=0.0, description='variables', max=3.0, style=ProgressStyle(description_widt…

c:\users\oye\appdata\local\programs\python\python37\lib\site-packages\pandas_profiling\model\describe.py:79: RuntimeWarning: overflow encountered in longlong_scalars
  stats["range"] = stats["max"] - stats["min"]

HBox(children=(FloatProgress(value=0.0, description='correlations', max=6.0, style=ProgressStyle(description_w…

HBox(children=(FloatProgress(value=0.0, description='interactions [continuous]', max=1.0, style=ProgressStyle(…

HBox(children=(FloatProgress(value=0.0, description='table', max=1.0, style=ProgressStyle(description_width='i…

HBox(children=(FloatProgress(value=0.0, description='missing', max=2.0, style=ProgressStyle(description_width=…

HBox(children=(FloatProgress(value=0.0, description='warnings', max=3.0, style=ProgressStyle(description_width…

HBox(children=(FloatProgress(value=0.0, description='package', max=1.0, style=ProgressStyle(description_width=…

HBox(children=(FloatProgress(value=0.0, description='build report structure', max=1.0, style=ProgressStyle(des…

In [19]:
#Replace the chinese values with English values in the 

lang_mapped_brands = { '华为':'Huawei', '小米':'Xiaomi', 
                         '三星':'Samsung', '魅族':'Meizu','酷派':'Coolpad',
                         '乐视':'LeEco', '联想 ':'Lenovo','奇酷':'Qiku',
                         '斐讯':'Feixun','中国移动':'China Mobile',
                         '天语':'Amagatarai','至尊宝':'Extreme treasure', 
                         '欧博信':'Obersin', '优米':'Quality rice',
                         '努比亚':'Nubian', '惠普':'HP', 
                         '尼比鲁':'Nibiru', '美图':'MitO', '乡米':'Xiangmi', '摩托罗拉':'Motorola',
                         '锤子':'Meng Mi', '富可视':'InFocus','海信':'Hisense',
                         '百立丰':'Bilifeng','一加':'OnePlus', '语信' :'Yuxin', '海尔' :'Haier', 
                         '酷比':'Coolby', '纽曼':'Newman',
                         '波导':'waveguide', '朵唯':'Duowei',
                         '聆韵':'Listening rhyme', '酷珀':'Cupper', '爱派尔':'Aipal', '青葱':'scallion',
                         '果米':'fruit rice', '华硕':'ASUS', '昂达':'Onda', '艾优尼':'Ayuni',
                         '康佳':'Konka', '优购':'Yougo', '邦华':'Banghua', '赛博宇华':'Saibo Yuhua', 
                         '黑米':'Black Rice', '先锋':'Pioneer', 'E派':'E School', 
                         '神舟':'Shenzhou', '诺基亚':'Nokia',
                         '普耐尔':'Puner', '糖葫芦':'Candied Gourd', '亿通':'Yitong', '欧新':'Ou Xin',
                         '米奇':'Mickey', '酷比魔方':'Cube Rubiks Cube', '蓝魔':'Blue Magic', 
                         '小杨树':'Little Poplar','贝尔丰':'Bell Fung', '糯米':'Glutinous Rice',
                         '米歌' :'Mi Ge' , 'E人E本':'E Man E Ben', '西米':'Simi', '大Q':'Big Q',
                         '台电':'Taipower', '飞利浦':'Philips', '唯米':'Vimi', '大显':'Da Xian', '长虹':'Changhong',
                         '维图':'Vitu','青橙':'Green Orange', '本为':'Originally', '虾米':'Shrimp', 
                         '夏新':'Xiaxin', '帷幄':'Virgin', '百加':'Baijia', '欧奇':'Ouqi', 
                         '世纪星':'Century Star', '智镁':'Chi Magnesium',
                         '欧比':'Obi', '基伍':'Kivu', '飞秒':'Femtosecond', '德赛':'Desai', 
                         '易派':'Epai', '谷歌':'Google', '金星数码':'Venus Digital', '广信':'Guangxin', '诺亚信':'Noyaxin',      
                         '凯利通':'Bai Mi', '唯比':'Da Ke Cola', '欧沃':'Bao Jie Xun', 
                         '丰米':'You Yu', '恒宇丰':'Shou Yun', '奥克斯':'Rumi', 
                         '西门子':'Rigao', '欧乐迪':'Wofengfeng','白米':'Mo Le', 
                         '大可乐':'Xian Mi', '宝捷讯':'Kelly Pass',
                         '优语':'Vibe', '首云':'Ovo', '瑞米':'Fengmi', '瑞高':'Hengyufeng', 
                         '沃普丰':'Aux', '摩乐':'Siemens', '鲜米':'Oledi'}

In [20]:
df_ph_brand_model = df_phone_brand_device_model.replace(lang_mapped_brands)
#df_new_phbd.to_csv('test.csv')
#df_new_phbd['brand'].unique()
df_ph_brand_model['phone_brand'].unique()

array(['vivo', 'Xiaomi', 'OPPO', 'Samsung', 'Coolpad', 'Lenovo', 'Huawei',
       'Qiku', 'Meizu', 'Feixun', 'China Mobile', 'HTC', 'Amagatarai',
       'Extreme treasure', 'LG', 'Obersin', 'Quality rice', 'ZUK',
       'Nubian', 'HP', 'Nibiru', 'MitO', 'Xiangmi', 'Motorola', '梦米',
       'Meng Mi', 'InFocus', 'LeEco', 'Hisense', 'Bilifeng', 'OnePlus',
       'Yuxin', 'Haier', 'Coolby', 'Newman', 'waveguide', 'Duowei',
       'Listening rhyme', 'TCL', 'Cupper', 'Aipal', 'LOGO', 'scallion',
       'fruit rice', 'ASUS', 'Onda', 'Ayuni', 'Konka', 'Yougo', 'Banghua',
       'Saibo Yuhua', 'Black Rice', 'Lovme', 'Pioneer', 'E School',
       'Shenzhou', 'Nokia', 'Puner', 'Candied Gourd', 'Yitong', 'Ou Xin',
       'Mickey', 'Cube Rubiks Cube', 'Blue Magic', 'Little Poplar',
       'Bell Fung', 'Glutinous Rice', 'Mi Ge', 'E Man E Ben', 'Simi',
       'Big Q', 'Taipower', 'Philips', 'Vimi', 'Da Xian', 'Changhong',
       'Vitu', 'Green Orange', 'Originally', 'Shrimp', 'Xiaxin', 'Virgin',
       'Baijia', 'SUGAR', 'Ouqi', 'Century Star', 'Chi Magnesium', 'Obi',
       'Kivu', 'Femtosecond', 'Desai', 'Epai', 'Google', 'Venus Digital',
       'Guangxin', 'Noyaxin', 'MIL', 'Mo Le', 'Xian Mi', 'Kelly Pass',
       'Vibe', 'Ovo', 'Fengmi', 'Hengyufeng', 'Aux', 'Siemens', 'Oledi',
       'Bai Mi', 'Da Ke Cola', 'Bao Jie Xun', 'You Yu', 'Shou Yun',
       'Rumi', 'Rigao', 'Wofengfeng', 'PPTV'], dtype=object)

In [21]:
df_new_ph_brand_model = df_ph_brand_model.groupby('phone_brand')
pd.DataFrame(df_new_ph_brand_model.size().reset_index(name = "Group_Count"))

    phone_brand  Group_Count
0          ASUS           67
1         Aipal           46
2    Amagatarai          161
3           Aux            8
4         Ayuni           48
..          ...          ...
111  fruit rice           10
112    scallion            7
113        vivo         7596
114   waveguide           44
115          梦米           52

[116 rows x 2 columns]

In [22]:
#classify the age group into features
'''
0-2 : infant
2-12: child
13-19: Teenager
20-23: young adults
24-60: adults
>60 : elderly
infant, child, adolescent, young adults, adults, elderly

'''
df_gender_age['agegroup_by_name'] = pd.cut(df_gender_age.age,bins=[0,2,12,19,22, 65,99],
                                           labels=['infant','Child', 'teenager','youngadult','Adult','Elderly'])
df_gender_age

                 device_id gender  age   group agegroup_by_name
0     -8076087639492063270      M   35  M32-38            Adult
1     -2897161552818060146      M   35  M32-38            Adult
2     -8260683887967679142      M   35  M32-38            Adult
3     -4938849341048082022      M   30  M29-31            Adult
4       245133531816851882      M   30  M29-31            Adult
...                    ...    ...  ...     ...              ...
74640  4682031842235089751      M   30  M29-31            Adult
74641 -9178703742877135986      M   30  M29-31            Adult
74642   180946546684162312      M   20    M22-       youngadult
74643  1390702386071991851      M   37  M32-38            Adult
74644    89181010588227347      M   25  M23-26            Adult

[74645 rows x 5 columns]

In [24]:
#convert the timestamp to a date in a new column event_date
import datetime as dt
df_events['Event_Date']=pd.to_datetime(pd.Series(df_events['timestamp']))
df_events['Event_Date']=df_events['Event_Date'].dt.date

In [25]:
df_events.head()

,event_id,device_id,timestamp,longitude,latitude,city,state,Event_Date
0,2765368,2.973348e+18,2016-05-07 22:52:05,77.225676,28.730140,Delhi,Delhi,2016-05-07
1,2955066,4.734221e+18,2016-05-01 20:44:16,88.388361,22.660325,Calcutta,WestBengal,2016-05-01
2,605968,-3.264500e+18,2016-05-02 14:23:04,77.256809,28.757906,Delhi,Delhi,2016-05-02
3,448114,5.731369e+18,2016-05-03 13:21:16,80.343613,13.153332,Chennai,TamilNadu,2016-05-03
4,665740,3.388880e+17,2016-05-06 03:51:05,85.997745,23.842609,Bokaro,Jharkhand,2016-05-06

In [26]:
df_events['device_id']=df_events.device_id.abs()
df_events.head()

,event_id,device_id,timestamp,longitude,latitude,city,state,Event_Date
0,2765368,2.973348e+18,2016-05-07 22:52:05,77.225676,28.730140,Delhi,Delhi,2016-05-07
1,2955066,4.734221e+18,2016-05-01 20:44:16,88.388361,22.660325,Calcutta,WestBengal,2016-05-01
2,605968,3.264500e+18,2016-05-02 14:23:04,77.256809,28.757906,Delhi,Delhi,2016-05-02
3,448114,5.731369e+18,2016-05-03 13:21:16,80.343613,13.153332,Chennai,TamilNadu,2016-05-03
4,665740,3.388880e+17,2016-05-06 03:51:05,85.997745,23.842609,Bokaro,Jharkhand,2016-05-06

In [33]:
null_columns=df_events.columns[df_events.isnull().any()]
print(df_events[df_events.isnull().any(axis=1)][null_columns].head())
df_events[null_columns].isnull().sum()

          device_id  longitude   latitude          state
2055            NaN  75.882956  22.814519  MadhyaPradesh
2931   5.829328e+18  73.851671  18.593313            NaN
8015   1.779631e+18        NaN        NaN          Delhi
9697   8.790560e+18        NaN        NaN  MadhyaPradesh
10949  4.865607e+18        NaN        NaN  AndhraPradesh

device_id    453
longitude    423
latitude     423
state        377
dtype: int64

In [127]:
df_events['state'].head(20)

0             Delhi
1        WestBengal
2             Delhi
3         TamilNadu
4         Jharkhand
5     AndhraPradesh
6         TamilNadu
7     AndhraPradesh
8             Delhi
9       Maharashtra
10        TamilNadu
11      Maharashtra
12    AndhraPradesh
13            Delhi
14        TamilNadu
15        TamilNadu
16        TamilNadu
17            Delhi
18            Delhi
19        TamilNadu
Name: state, dtype: object

In [34]:
events_null=df_events[df_events.isnull().any(axis=1)]

In [35]:
events_state=events_null[events_null['state'].isnull()]

In [36]:
events_null['state'].unique()

array(['MadhyaPradesh', nan, 'Delhi', 'AndhraPradesh', 'TamilNadu',
       'Maharashtra', 'Rajasthan', 'Punjab', 'Bihar', 'Gujarat'],
      dtype=object)

In [131]:
#df_events = 
#temp = df_events.copy()
city_state_dict = { "Indore": "MadhyaPradesh","Visakhapatnam" : "AndhraPradesh", "Delhi": "Delhi",
                    "Chennai" : "TamilNadu", "Jaipur":"Rajasthan", "Gangarampur":"WestBengal", 
                    "Arambagh": "WestBengal", "Channapatna": "Karnataka", "Pune": "Maharashtra"}

for key, value in city_state_dict.items():
    df_events.loc[(df_events['city'] == key) \
    & (df_events['state'].isnull()),'state'] = value

In [172]:
df_events['state'].isnull().sum()

0

In [244]:
#check the lat long of the missing device ids
df_missing_device_ids = df_events[df_events['device_id'].isnull()]

df_missing_device_ids
#df_missing_device_ids.longitude.unique()

,event_id,device_id,timestamp,longitude,latitude,city,state,Event_Date
2055,1936567,NaN,2016-05-02 15:27:54,75.882956,22.814519,Indore,MadhyaPradesh,2016-05-02
26367,2659282,NaN,2016-05-04 14:06:24,75.888487,26.948689,Jaipur,Rajasthan,2016-05-04
42088,442198,NaN,2016-05-06 09:27:37,75.846007,26.960796,Jaipur,Rajasthan,2016-05-06
43061,1903648,NaN,2016-05-02 15:41:54,75.923332,22.777781,Indore,MadhyaPradesh,2016-05-02
44823,3227383,NaN,2016-05-05 08:37:09,75.992551,31.561747,Hoshiarpur,Punjab,2016-05-05
...,...,...,...,...,...,...,...,...
3212337,2191286,NaN,2016-05-04 18:16:06,83.357991,17.805195,Visakhapatnam,AndhraPradesh,2016-05-04
3215120,572054,NaN,2016-05-07 08:48:22,83.371738,17.752819,Visakhapatnam,AndhraPradesh,2016-05-07
3230115,332451,NaN,2016-05-07 09:01:45,75.992551,31.561747,Hoshiarpur,Punjab,2016-05-07
3235494,2534073,NaN,2016-05-06 21:07:01,83.371738,17.752819,Visakhapatnam,AndhraPradesh,2016-05-06
3250939,1622538,NaN,2016-05-06 21:26:10,75.888487,26.948689,Jaipur,Rajasthan,2016-05-06

In [278]:
df_missing_device_ids.latitude.unique()

array([22.814519, 26.948689, 26.960796, 22.777781, 31.561747, 18.628057,
       18.566925, 17.805195, 28.719966, 18.614812, 13.153332, 13.149176,
       28.721053, 17.752819, 22.817526, 17.822906, 26.95399 , 13.189053,
       21.194283, 21.790693, 28.728888])

In [547]:
df_events_copy = df_events.copy()

In [518]:
df_events_copy.isnull().sum()

event_id        0
device_id     453
timestamp       0
longitude     423
latitude      423
city            0
state           0
Event_Date      0
dtype: int64

In [520]:
zzz = df_events_copy.loc[df_events_copy['device_id'].isnull()]
zzz.count()

event_id      453
device_id       0
timestamp     453
longitude     453
latitude      453
city          453
state         453
Event_Date    453
dtype: int64

In [522]:
unique_missing_lats = df_missing_device_ids.latitude.unique()

x = df_events_copy[(df_events_copy['latitude'] == u)]
x

,event_id,device_id,timestamp,longitude,latitude,city,state,Event_Date
1994,923207,6.875586e+18,2016-05-04 09:02:19,77.303153,28.728888,Delhi,Delhi,2016-05-04
4825,1707403,6.875586e+18,2016-05-04 07:49:19,77.303153,28.728888,Delhi,Delhi,2016-05-04
5353,2723414,6.875586e+18,2016-05-02 12:00:48,77.303153,28.728888,Delhi,Delhi,2016-05-02
7143,2485681,6.875586e+18,2016-05-07 18:06:32,77.303153,28.728888,Delhi,Delhi,2016-05-07
7659,1628919,6.875586e+18,2016-05-03 04:29:35,77.303153,28.728888,Delhi,Delhi,2016-05-03
...,...,...,...,...,...,...,...,...
3243223,2252278,6.875586e+18,2016-05-03 23:06:08,77.303153,28.728888,Delhi,Delhi,2016-05-03
3244269,224735,6.875586e+18,2016-05-05 11:45:37,77.303153,28.728888,Delhi,Delhi,2016-05-05
3246386,926517,6.875586e+18,2016-05-02 12:50:34,77.303153,28.728888,Delhi,Delhi,2016-05-02
3247698,1986657,6.875586e+18,2016-05-06 01:28:05,77.303153,28.728888,Delhi,Delhi,2016-05-06
3252842,3238012,6.875586e+18,2016-05-03 15:19:36,77.303153,28.728888,Delhi,Delhi,2016-05-03

In [549]:
def filldeviceIdFromOtherRowsWithDeviceIdandLongitude(long):
    #print(long)
    #find the device id for the mapped longitude
    deviceIdmappedAlready = df_events_copy[(df_events_copy["longitude"]==long) &
                                           ~(pd.isnull(df_events_copy["device_id"]))].head(1)["device_id"].item()
    return deviceIdmappedAlready
df_events_copy["device_id"]=df_events_copy.apply(lambda x : filldeviceIdFromOtherRowsWithDeviceIdandLongitude(x['longitude']) if pd.isnull(x['device_id']) else  x['device_id'],axis = 1) 

df_events_copy.isnull().sum()

c:\users\oye\appdata\local\programs\python\python37\lib\site-packages\ipykernel_launcher.py:5: FutureWarning: `item` has been deprecated and will be removed in a future version
  """

event_id        0
device_id       0
timestamp       0
longitude     423
latitude      423
city            0
state           0
Event_Date      0
dtype: int64

In [550]:
def filllongitudelatFromOtherRowsWithDeviceIdandLongitudelattitude(deviceId):
    #print(long)
    #find the device id for the mapped longitude
    longitudelattitudealreadymapped = df_events_copy[(df_events_copy["device_id"]==deviceId) & ~(pd.isnull(df_events_copy["longitude"]))].head(1)["longitude"].item()
    return longitudelattitudealreadymapped
df_events_copy["longitude"]=df_events_copy.apply(lambda x : filllongitudelatFromOtherRowsWithDeviceIdandLongitudelattitude(x['device_id']) if pd.isnull(x['longitude']) else  x['longitude'],axis = 1) 
df_events_copy["latitude"]=df_events_copy.apply(lambda x : filllongitudelatFromOtherRowsWithDeviceIdandLongitudelattitude(x['device_id']) if pd.isnull(x['latitude']) else  x['latitude'],axis = 1) 

df_events_copy.isnull().sum()

c:\users\oye\appdata\local\programs\python\python37\lib\site-packages\ipykernel_launcher.py:4: FutureWarning: `item` has been deprecated and will be removed in a future version
  after removing the cwd from sys.path.

event_id      0
device_id     0
timestamp     0
longitude     0
latitude      0
city          0
state         0
Event_Date    0
dtype: int64

In [577]:
df_events[ (df_events.latitude == 22.777781) & (df_events.device_id.isnull())]

,event_id,device_id,timestamp,longitude,latitude,city,state,Event_Date
43061,1903648,NaN,2016-05-02 15:41:54,75.923332,22.777781,Indore,MadhyaPradesh,2016-05-02
306432,2370402,NaN,2016-05-01 16:20:07,75.923332,22.777781,Indore,MadhyaPradesh,2016-05-01
383158,62725,NaN,2016-05-05 23:29:23,75.923332,22.777781,Indore,MadhyaPradesh,2016-05-05
413009,520053,NaN,2016-05-01 16:23:00,75.923332,22.777781,Indore,MadhyaPradesh,2016-05-01
647442,1205324,NaN,2016-05-02 15:42:14,75.923332,22.777781,Indore,MadhyaPradesh,2016-05-02
939430,53038,NaN,2016-05-01 18:11:24,75.923332,22.777781,Indore,MadhyaPradesh,2016-05-01
1073996,3214579,NaN,2016-05-05 22:24:32,75.923332,22.777781,Indore,MadhyaPradesh,2016-05-05
1134447,1102536,NaN,2016-05-06 21:19:09,75.923332,22.777781,Indore,MadhyaPradesh,2016-05-06
1411525,1558323,NaN,2016-05-01 21:53:01,75.923332,22.777781,Indore,MadhyaPradesh,2016-05-01
1528115,1261612,NaN,2016-05-04 19:07:05,75.923332,22.777781,Indore,MadhyaPradesh,2016-05-04
1727907,2762149,NaN,2016-05-07 20:49:42,75.923332,22.777781,Indore,MadhyaPradesh,2016-05-07
1906925,310080,NaN,2016-05-02 15:37:17,75.923332,22.777781,Indore,MadhyaPradesh,2016-05-02
2258158,754221,NaN,2016-05-04 20:57:43,75.923332,22.777781,Indore,MadhyaPradesh,2016-05-04
2898335,1974053,NaN,2016-05-01 18:12:07,75.923332,22.777781,Indore,MadhyaPradesh,2016-05-01
2976436,2621408,NaN,2016-05-04 18:24:57,75.923332,22.777781,Indore,MadhyaPradesh,2016-05-04
3079907,908097,NaN,2016-05-04 18:56:54,75.923332,22.777781,Indore,MadhyaPradesh,2016-05-04
3097256,1674442,NaN,2016-05-06 15:47:24,75.923332,22.777781,Indore,MadhyaPradesh,2016-05-06

In [579]:
df_events_copy[ (df_events_copy.latitude == 22.814519) & (df_events_copy.event_id==1350986)]

,event_id,device_id,timestamp,longitude,latitude,city,state,Event_Date
1547987,1350986,3.132861e+18,2016-05-01 22:11:23,75.882956,22.814519,Indore,MadhyaPradesh,2016-05-01

In [580]:
df_events_copy[ (df_events_copy.latitude == 22.777781) & (df_events_copy.event_id==1903648)]

,event_id,device_id,timestamp,longitude,latitude,city,state,Event_Date
43061,1903648,7.597736e+18,2016-05-02 15:41:54,75.923332,22.777781,Indore,MadhyaPradesh,2016-05-02

In [593]:
from numpy import nan
#loop thru all the latitude values in the missing_device_ids

value_to_copy = 0

for u in unique_missing_lats:
    device_id_list = df_events_copy.loc[df_events_copy.latitude == u].device_id
    #print(device_id_list)
    for i in device_id_list:
        if(~np.isnan(i)):
            value_to_copy = i
            #print(value_to_copy)
            break;
    if(value_to_copy != 0):
        x = df_events_copy[df_events_copy['device_id'].isnull() & 
                       df_events_copy.latitude == u]
        print(x.latitude)
        #print(df_events_copy[df_events_copy['device_id'].isnull()].device_id)
        df_events_copy.apply[df_events_copy['device_id'].isnull() & 
                       df_events_copy.latitude == u].device_id = value_to_copy
        #print(value_to_copy)

#df_events_copy.isnull().sum()

Series([], Name: latitude, dtype: float64)

TypeError: 'method' object is not subscriptable

In [581]:
df_events_copy.isnull().sum()
#df_events.device_id.isnull().sum()

event_id      0
device_id     0
timestamp     0
longitude     0
latitude      0
city          0
state         0
Event_Date    0
dtype: int64

In [266]:
y = df_events.loc[df_events.device_id.isnull()]
y.latitude.unique()

array([22.814519, 26.948689, 26.960796, 22.777781, 31.561747, 18.628057,
       18.566925, 17.805195, 28.719966, 18.614812, 13.153332, 13.149176,
       28.721053, 17.752819, 22.817526, 17.822906, 26.95399 , 13.189053,
       21.194283, 21.790693, 28.728888])

In [277]:
x = df_events.loc[df_events.latitude == 22.814519]
x.device_id.value_counts()

3.132861e+18    753
Name: device_id, dtype: int64

In [274]:
p = df_missing_device_ids.loc[df_events.latitude == 22.814519]
p.latitude.value_counts()

22.814519    17
Name: latitude, dtype: int64

In [241]:
nulldeviceids = df_events[df_events['device_id'].isnull()]
z = nulldeviceids.loc[df_events.longitude == 75.846007]
z.count()
z

,event_id,device_id,timestamp,longitude,latitude,city,state,Event_Date
42088,442198,NaN,2016-05-06 09:27:37,75.846007,26.960796,Jaipur,Rajasthan,2016-05-06
108238,257081,NaN,2016-05-07 16:19:28,75.846007,26.960796,Jaipur,Rajasthan,2016-05-07
296399,873328,NaN,2016-05-06 14:54:57,75.846007,26.960796,Jaipur,Rajasthan,2016-05-06
460648,1248095,NaN,2016-05-02 09:40:11,75.846007,26.960796,Jaipur,Rajasthan,2016-05-02
556261,1847124,NaN,2016-05-02 08:13:08,75.846007,26.960796,Jaipur,Rajasthan,2016-05-02
950114,177858,NaN,2016-05-05 14:28:03,75.846007,26.960796,Jaipur,Rajasthan,2016-05-05
1007700,1686053,NaN,2016-05-06 14:55:27,75.846007,26.960796,Jaipur,Rajasthan,2016-05-06
1076709,3091188,NaN,2016-05-03 08:04:34,75.846007,26.960796,Jaipur,Rajasthan,2016-05-03
1252696,1322884,NaN,2016-05-03 22:19:44,75.846007,26.960796,Jaipur,Rajasthan,2016-05-03
1297293,3132907,NaN,2016-05-03 07:23:37,75.846007,26.960796,Jaipur,Rajasthan,2016-05-03
1303002,615611,NaN,2016-05-03 22:15:57,75.846007,26.960796,Jaipur,Rajasthan,2016-05-03
1341460,1427650,NaN,2016-05-05 14:22:20,75.846007,26.960796,Jaipur,Rajasthan,2016-05-05
1480943,2588461,NaN,2016-05-01 16:29:57,75.846007,26.960796,Jaipur,Rajasthan,2016-05-01
1751405,1932121,NaN,2016-05-01 12:13:40,75.846007,26.960796,Jaipur,Rajasthan,2016-05-01
1982469,2590058,NaN,2016-05-07 16:27:17,75.846007,26.960796,Jaipur,Rajasthan,2016-05-07
2014653,2315841,NaN,2016-05-03 07:38:46,75.846007,26.960796,Jaipur,Rajasthan,2016-05-03
2071401,3205287,NaN,2016-05-01 16:44:09,75.846007,26.960796,Jaipur,Rajasthan,2016-05-01
2105453,2737861,NaN,2016-05-03 09:27:56,75.846007,26.960796,Jaipur,Rajasthan,2016-05-03
2280255,2657885,NaN,2016-05-07 13:37:03,75.846007,26.960796,Jaipur,Rajasthan,2016-05-07
2335369,2185164,NaN,2016-05-05 13:19:03,75.846007,26.960796,Jaipur,Rajasthan,2016-05-05
2489592,205784,NaN,2016-05-01 16:22:05,75.846007,26.960796,Jaipur,Rajasthan,2016-05-01
2531834,748506,NaN,2016-05-03 22:13:57,75.846007,26.960796,Jaipur,Rajasthan,2016-05-03
2585554,2782254,NaN,2016-05-01 16:39:32,75.846007,26.960796,Jaipur,Rajasthan,2016-05-01
2586055,629274,NaN,2016-05-01 11:43:00,75.846007,26.960796,Jaipur,Rajasthan,2016-05-01
2800109,283186,NaN,2016-05-05 16:14:43,75.846007,26.960796,Jaipur,Rajasthan,2016-05-05
2838175,127874,NaN,2016-05-02 10:22:32,75.846007,26.960796,Jaipur,Rajasthan,2016-05-02
2984574,2180168,NaN,2016-05-06 09:25:23,75.846007,26.960796,Jaipur,Rajasthan,2016-05-06

In [ ]:
#df_events_data = df_events.copy()
#df_events_data.loc[(df_events_data['city'] =='Araria') \
#                   & (df_events_data['longitude'].isnull()),'longitude']= '87.578218'
#df_events_data.loc[(df_events_data['city'] =='Araria') \
#                   & (df_events_data['latitude'].isnull()),'latitude']= '26.209851'

In [148]:
events_longitude=events_null[events_null['longitude'].isnull()]

423

In [165]:
df_events_data = df_events.copy()


df_events[(df_events["longitude"] == 80.30927199999998)]

AttributeError: 'DataFrame' object has no attribute 'unique'

In [171]:
t = df_events.groupby('device_id')
pd.DataFrame(t.size().reset_index(name = "Group_Count"))

          device_id  Group_Count
0      5.036611e+13            1
1      1.226564e+14            2
2      2.369780e+14           13
3      2.909557e+14            6
4      4.566137e+14           75
...             ...          ...
60860  9.221843e+18           17
60861  9.222173e+18           20
60862  9.222755e+18            1
60863  9.222849e+18            2
60864  9.222957e+18           65

[60865 rows x 2 columns]

In [149]:
cityist_latlong = ['Delhi', 'Indore', 'Visakhapatnam', 'Chennai', 'Pune', 'Jaipur', 'Araria', 'Moga', 'Bagaha' ]

for city in cityist_latlong:
    df_events_data.loc[(df_events_data['city'] == city) \
                   (df_events_data['longitude'].isnull()),'longitude'] = \
                    df_events_data['longitude'][df_events_data['city']==city].mean()
    df_events_data.loc[(df_events_data['city'] ==city) \
                   (df_events_data['latitude'].isnull()),'latitude'] = \
                    df_events_data['longitude'][df_events_data['city']==city].mean()

df_events_data['longitude'].isnull().sum()

TypeError: 'Series' object is not callable

In [41]:

events_longitude['longitude'].mask(events_longitude['city'] == 'Delhi', 
                                   df_events['longitude'][df_events['city']=='Delhi'].mean(), inplace=True)
events_longitude['latitude'].mask(events_longitude['city'] == 'Delhi', 
                                  df_events['latitude'][df_events['city']=='Delhi'].mean(), inplace=True)
events_longitude['longitude'].mask(events_longitude['city'] == 'Indore', 
                                   df_events['longitude'][df_events['city']=='Indore'].mean(), inplace=True)
events_longitude['latitude'].mask(events_longitude['city'] == 'Indore', 
                                  df_events['latitude'][df_events['city']=='Indore'].mean(), inplace=True)

In [42]:
events_longitude['longitude'].mask(events_longitude['city'] == 'Visakhapatnam', 
                                   df_events['longitude'][df_events['city']=='Visakhapatnam'].mean(), inplace=True)
events_longitude['latitude'].mask(events_longitude['city'] == 'Visakhapatnam', 
                                  df_events['latitude'][df_events['city']=='Visakhapatnam'].mean(), inplace=True)
events_longitude['longitude'].mask(events_longitude['city'] == 'Chennai', 
                                   df_events['longitude'][df_events['city']=='Chennai'].mean(), inplace=True)
events_longitude['latitude'].mask(events_longitude['city'] == 'Chennai', 
                                  df_events['latitude'][df_events['city']=='Chennai'].mean(), inplace=True)

In [43]:
events_longitude['longitude'].mask(events_longitude['city'] == 'Pune', 
                                   df_events['longitude'][df_events['city']=='Pune'].mean(), inplace=True)
events_longitude['latitude'].mask(events_longitude['city'] == 'Pune', 
                                  df_events['latitude'][df_events['city']=='Pune'].mean(), inplace=True)
events_longitude['longitude'].mask(events_longitude['city'] == 'Jaipur', 
                                   df_events['longitude'][df_events['city']=='Jaipur'].mean(), inplace=True)
events_longitude['latitude'].mask(events_longitude['city'] == 'Jaipur', 
                                  df_events['latitude'][df_events['city']=='Jaipur'].mean(), inplace=True)
events_longitude['longitude'].mask(events_longitude['city'] == 'Araria', 
                                   df_events['longitude'][df_events['city']=='Araria'].mean(), inplace=True)
events_longitude['latitude'].mask(events_longitude['city'] == 'Araria', 
                                  df_events['latitude'][df_events['city']=='Araria'].mean(), inplace=True)
events_longitude['longitude'].mask(events_longitude['city'] == 'Moga', 
                                   df_events['longitude'][df_events['city']=='Moga'].mean(), inplace=True)
events_longitude['latitude'].mask(events_longitude['city'] == 'Moga', 
                                  df_events['latitude'][df_events['city']=='Moga'].mean(), inplace=True)
events_longitude['longitude'].mask(events_longitude['city'] == 'Bagaha', 
                                   df_events['longitude'][df_events['city']=='Bagaha'].mean(), inplace=True)
events_longitude['latitude'].mask(events_longitude['city'] == 'Bagaha', 
                                  df_events['latitude'][df_events['city']=='Bagaha'].mean(), inplace=True)

In [44]:
events_longitude['city'].unique()

array(['Delhi', 'Indore', 'Visakhapatnam', 'Chennai', 'Pune', 'Jaipur',
       'Araria', 'Moga', 'Bagaha'], dtype=object)

In [45]:
events_longitude['state'].isnull().sum()

0

In [46]:
events_longitude['device_id'].isnull().sum()

0

In [47]:
events_longitude.head()
#events_longitude.count()

,event_id,device_id,timestamp,longitude,latitude,city,state,Event_Date
8015,2929521,1.779631e+18,2016-05-05 01:15:22,77.265087,28.725504,Delhi,Delhi,2016-05-05
9697,1017749,8.790560e+18,2016-05-03 17:22:52,75.915123,22.776007,Indore,MadhyaPradesh,2016-05-03
10949,2132415,4.865607e+18,2016-05-07 19:57:06,83.353957,17.785285,Visakhapatnam,AndhraPradesh,2016-05-07
16038,926804,7.983871e+18,2016-05-03 12:29:47,80.327087,13.143763,Chennai,TamilNadu,2016-05-03
20586,3074782,7.364841e+18,2016-05-04 19:39:28,73.893955,18.585192,Pune,Maharashtra,2016-05-04

In [81]:
#now we have 3 sets- again cross check if there any nulls
phone_brand_device_model_data = df_ph_brand_model.copy()
phone_brand_device_model_data.isnull().sum()

device_id       0
phone_brand     0
device_model    0
dtype: int64

In [49]:
gender_age_data = df_gender_age.copy()
gender_age_data.isnull().sum()

device_id           0
gender              0
age                 0
group               0
agegroup_by_name    0
dtype: int64

In [47]:
phone_brand_device_model_data.to_csv("changed_phdm.csv")

In [49]:
gender_age_data.to_csv("changed_ga.csv")

In [50]:
events_longitude.head()

,event_id,device_id,timestamp,longitude,latitude,city,state,Event_Date
8015,2929521,1.779631e+18,2016-05-05 01:15:22,77.265087,28.725504,Delhi,Delhi,2016-05-05
9697,1017749,8.790560e+18,2016-05-03 17:22:52,75.915123,22.776007,Indore,MadhyaPradesh,2016-05-03
10949,2132415,4.865607e+18,2016-05-07 19:57:06,83.353957,17.785285,Visakhapatnam,AndhraPradesh,2016-05-07
16038,926804,7.983871e+18,2016-05-03 12:29:47,80.327087,13.143763,Chennai,TamilNadu,2016-05-03
20586,3074782,7.364841e+18,2016-05-04 19:39:28,73.893955,18.585192,Pune,Maharashtra,2016-05-04

In [51]:
events_state.head()

,event_id,device_id,timestamp,longitude,latitude,city,state,Event_Date
2931,706554,5.829328e+18,2016-05-05 16:58:46,73.851671,18.593313,Pune,Maharashtra,2016-05-05
16243,1918653,3.137054e+18,2016-05-03 00:46:10,83.326714,17.829748,Visakhapatnam,AndhraPradesh,2016-05-03
26956,1068940,1.752057e+18,2016-05-04 16:09:17,75.930969,22.818845,Indore,MadhyaPradesh,2016-05-04
30889,2164200,3.945827e+17,2016-05-04 19:33:09,83.366564,17.757190,Visakhapatnam,AndhraPradesh,2016-05-04
32685,460124,5.536513e+18,2016-05-01 21:30:10,80.359796,13.128174,Chennai,TamilNadu,2016-05-01

In [582]:

events_data = df_events_copy.copy()
events_data.isnull().sum()

#Here we have to replace events_longitude data in the events_data

event_id      0
device_id     0
timestamp     0
longitude     0
latitude      0
city          0
state         0
Event_Date    0
dtype: int64

### Merge the datasets

In [583]:
#Should we do the merge on outer or inner
phone_brand_device_model_data.count()
#outer will have all records

device_id       87726
phone_brand     87726
device_model    87726
dtype: int64

In [584]:
gender_age_data.count()

device_id           74645
gender              74645
age                 74645
group               74645
agegroup_by_name    74645
dtype: int64

In [55]:
#***********TBD******************

#sai - we need to merge the records of events_longitude and events_state to be merged with df_events
df_events.head()

,event_id,device_id,timestamp,longitude,latitude,city,state,Event_Date
0,2765368,2.973348e+18,2016-05-07 22:52:05,77.225676,28.730140,Delhi,Delhi,2016-05-07
1,2955066,4.734221e+18,2016-05-01 20:44:16,88.388361,22.660325,Calcutta,WestBengal,2016-05-01
2,605968,3.264500e+18,2016-05-02 14:23:04,77.256809,28.757906,Delhi,Delhi,2016-05-02
3,448114,5.731369e+18,2016-05-03 13:21:16,80.343613,13.153332,Chennai,TamilNadu,2016-05-03
4,665740,3.388880e+17,2016-05-06 03:51:05,85.997745,23.842609,Bokaro,Jharkhand,2016-05-06

In [585]:
#Device ID in phone_brand_device_model_data is it present in events_data, 
#same we have to check for gender_age_data Device_id presence in Events_data

#phone_brand_device_model_data = phone_brand_device_model_data['device_id'].isin(events_data['device_id'])
df = phone_brand_device_model_data.copy()

df = df[df['device_id'].isin(events_data['device_id'])]
df.count()

device_id       184
phone_brand     184
device_model    184
dtype: int64

In [586]:
df_g = gender_age_data.copy()

df_g = df_g[df_g['device_id'].isin(events_data['device_id'])]
df_g.count()

device_id           184
gender              184
age                 184
group               184
agegroup_by_name    184
dtype: int64

In [587]:

df1 = phone_brand_device_model_data.copy()
df2 = gender_age_data.copy()
#df1 = df1[df1['device_id'].isin(df2['device_id'])]
#print(abs(df2['device_id'].count()-df1['device_id'].count()))
gender_age_data['device_id'].count()

74645

In [588]:
phone_brand_device_model_data.count()

device_id       87726
phone_brand     87726
device_model    87726
dtype: int64

In [589]:
events_data['device_id'].count()

3252950

In [590]:

#Check all unique device_id in Events Table which are not present in othe table's device_id
phone_age_merge = pd.merge(phone_brand_device_model_data, gender_age_data,on='device_id',how='left')


phone_age_merge.isnull().sum()
phone_age_merge.count()

device_id           87726
phone_brand         87726
device_model        87726
gender              74617
age                 74617
group               74617
agegroup_by_name    74617
dtype: int64

In [591]:


event_phone_gender_merge = pd.merge(events_data, phone_age_merge ,on='device_id',how='left')
event_phone_gender_merge.count()

event_id            3252950
device_id           3252950
timestamp           3252950
longitude           3252950
latitude            3252950
city                3252950
state               3252950
Event_Date          3252950
phone_brand            8855
device_model           8855
gender                 8855
age                    8855
group                  8855
agegroup_by_name       8855
dtype: int64

In [592]:
event_phone_gender_merge.isnull().sum()

event_id                  0
device_id                 0
timestamp                 0
longitude                 0
latitude                  0
city                      0
state                     0
Event_Date                0
phone_brand         3244095
device_model        3244095
gender              3244095
age                 3244095
group               3244095
agegroup_by_name    3244095
dtype: int64

In [ ]:
#df = pd.merge(df_temp, events_data, on='device_id', how='outer')
#df.head(10)